Revit 2027 API
ExportPatternKey.OriginalFillPatternName Property
 The original FillPattern name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string OriginalFillPatternName { get; set; }
Public Property OriginalFillPatternName As String
	Get
	Set
public:
property String^ OriginalFillPatternName {
	String^ get ();
	void set (String^ value);
}
member OriginalFillPatternName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExportPatternKey Class
Autodesk.Revit.DB Namespace